# Pandas

# Data manipulation with Pandas

- Pandas is a python package that allows you to work with large data sets.
- It offers tools for data analysis,Exploration, and manipulation of data.
- Pandas library is built on top of the NumPy which means Numpy is required for operating the Pandas. NumPy is great for mathmatical computing

<br><font size = 6>Pandas With sereral functionalities
               <br><font size = 4> NumPy

# Pandas Vs NumPy

- Pandas ia desgined for working with tabular or heterogeneous data (With deffrent data types)
- Numpy is best suited for working with homegeneously (with same data types) typed numerical array data.

# Features of Pandas -:
- Powerful data structure
- Fast and efficient data wrangling 
- Easy data aggregation merging and joining of data sets.
- Intelligent and automatical data alignment 
- Tools for reading and writing data

<font size =4><br> It is a useful library for data scientists because of its numerous features.

# Understanding Series -:
- A series is a One-dimensional array - like Object containing a sequence of values of the same type and an associated array of data labels called its index.
- DATA - [4,11,21,36]
- Lables-[0, 1, 2, 3] (index lables)


<br> <font size = 6>**Note** -:<font size =4>Data alignments is intrinsic, i.e, the link between lables and data will not be broken unless done so explicitly by you.

# Data Frame-:
- A Data Frame represents a rectargular table of data and contains a collection of columns each of which can be different value types (hetrogeneous).
- A Data Frame has both a row and columns index.
- Each columns in a Data Frame is a Series.

In [2]:
import pandas as pd # Importin the pandas library

# Series

<br> **Pandas Series objects are generally created from the following data types:-**
<br>  1. Scalar
<br>  2. ndarrray
<br>  3. Dictionary
<br>  4. List

In [3]:
import numpy as np

In [6]:
import pandas as pd

In [2]:
x = pd.Series("Python")
x

0    Python
dtype: object

In [7]:
y = np.array([1,2,3,4])
z = pd.Series(y)
z

0    1
1    2
2    3
3    4
dtype: int32

In [9]:
c = [1,2,3,4,5,6]
b = pd.Series(c)
b

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [10]:
d = {"a":12,"b":13}
f = pd.Series(d)
f

a    12
b    13
dtype: int64

<br>pd.Series(data,index,dtype)

In [3]:
# creating from a scalar value
x = pd.Series("string")
x                              # 0 reperting index value

0    string
dtype: object

In [4]:
# Creating from a ndarray
import numpy as np
arr = np.array([1,2,3,4,5])
series1 = pd.Series(arr)
print(series1)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [5]:
# Creating from a list
List = [1,2,3,4,5,6,7,8,9,10]
series2 = pd.Series(List)
print(series2)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [6]:
# Creating from a Dictionary
# Keys of the dictionary became the index
dict1 = {1:23,"b":34,"c":45,3:56}
series3 = pd.Series(dict1)
print(series3)

1    23
b    34
c    45
3    56
dtype: int64

# Let's provide the index also

In [10]:
x = pd.Series(["Welcome","To","ViJai"],index =["a",1,"c"])
x

a    Welcome
1         To
c      ViJai
dtype: object

In [26]:
x = pd.Series(["Welcome","To","ViJai"],index =[1,2,3])
x

1    Welcome
2         To
3      ViJai
dtype: object

# Important Opereations

<br> Data alignment is intrinsic
<br> Using Numpy functions or NumPy operations, such a filtering with a boolean array and scalar multiplication will preserve the index-value link

In [23]:
import pandas as pd

In [24]:
y = pd.Series([1,2,3,4,4,7,2,8])
y>=4   # This gives a boolean series

0    False
1    False
2    False
3     True
4     True
5     True
6    False
7     True
dtype: bool

In [25]:
y[y>=4]

3    4
4    4
5    7
7    8
dtype: int64

In [26]:
# Multiplying by a scalar
y*3

0     3
1     6
2     9
3    12
4    12
5    21
6     6
7    24
dtype: int64

In [27]:
y+2

0     3
1     4
2     5
3     6
4     6
5     9
6     4
7    10
dtype: int64

In [28]:
y-2

0   -1
1    0
2    1
3    2
4    2
5    5
6    0
7    6
dtype: int64

In [38]:
import numpy as np
np.sqrt(y)

0    1.732051
1    2.000000
2    2.236068
3    2.449490
dtype: float64

In [37]:
x = pd.Series([2,3,4,5])
y = pd.Series([3,4,5,6])
z = x+y
z

0     5
1     7
2     9
3    11
dtype: int64

In [34]:
x = pd.Series(["a","b","d","k"])  # NaN is call not number
y = pd.Series(["c","d","c"])
z = x+y
z

0     ac
1     bd
2     dc
3    NaN
dtype: object

In [44]:
y = pd.Series(["a",2,"d",3,False],index = ["a","b","c","d","e"])
y

a        a
b        2
c        d
d        3
e    False
dtype: object

In [52]:
x = pd.Series([2,3,4,5],index = ["a","b","c","d"])
y = pd.Series([3,4,5,6],index = ["a","b","c","d"])
z = x+y
z

a     5
b     7
c     9
d    11
dtype: int64

In [54]:
x = pd.Series([2,3,4,5],index = ["a","b","c","d"])   # both of add a+a,b+b,c+c,d+d 
y = pd.Series([3,4,5,6],index = ["c","a","d","b"])
z = x+y
z

a     6
b     9
c     7
d    10
dtype: int64

In [55]:
x = pd.Series([2,3,4,5],index = ["a","b","c","d"])
y = pd.Series([3,4,5,6],index = ["c","a","d",3])
z = x+y
z

3     NaN
a     6.0
b     NaN
c     7.0
d    10.0
dtype: float64

In [4]:
import numpy as np

In [23]:
x = np.array([[2,3,4],[5,7,6]])
print(x[0][1])
print(x[1][2])

3
6

In [17]:
x = [2,3,3,2,[7,4,6,7,8]]
x[4][3]

7

In [12]:
x = pd.DataFrame([1,2,3,4])
x

   0
0  1
1  2
2  3
3  4

In [27]:
y = pd.DataFrame([{"A":11,"B":12}])
y

    A   B
0  11  12

In [16]:
g = [3,4,5,6,7]
h = pd.DataFrame(g)
h

   0
0  3
1  4
2  5
3  6
4  7

In [25]:
x= pd.Series([2,3,4])
z = pd.Series([5,6,7])
y = pd.DataFrame({"a":x,"b":z})
y

   a  b
0  2  5
1  3  6
2  4  7

In [31]:
df = pd.DataFrame({"a":np.array([1,2,3]),"b":np.array([4,5,6])})
df

   a  b
0  1  4
1  2  5
2  3  6

In [35]:
df = pd.DataFrame({"a":([1,2,3]),"b":([4,5,6])})
print(df)
print(type(df))

   a  b
0  1  4
1  2  5
2  3  6
<class 'pandas.core.frame.DataFrame'>

In [36]:
df = pd.DataFrame({"a":{1,2,3},"b":{4,5,6}})
df

TypeError: 'set' type is unordered

In [37]:
df = pd.DataFrame([1,2,3],index = ["cc","bb","aa"])
df

    0
cc  1
bb  2
aa  3

In [44]:
df.reindex(["aa","bb","cc"])

    0
aa  3
bb  2
cc  1

In [47]:
df.index= [2,1,3]
df

   0
2  1
1  2
3  3


# Data Frame 
- Pandas Data Frame objects are generally created from the following data types:-
    <br>1. ndarray
    <br>2.Dictionary
    <br>3.List
    <br>4.Series
    <br>5.Data Frame

In [31]:
#using ndarray
new_data = pd.DataFrame([[1,2,3,4,5],   # Can only create from 2d and 1d array
                         [6,7,8,9,10]])
new_data

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [37]:
#using a list
x = pd.DataFrame([[1,2,3,4,],[5,6,7,8]],index = ["a","b"])
print(x)

   0  1  2  3
a  1  2  3  4
b  5  6  7  8

In [35]:
Dic_data_frame =  pd.DataFrame({"a":{1:"welcome",2:"to"},"b":{3:"hello" , 4:"hi"}})
Dic_data_frame

         a      b
1  welcome    NaN
2       to    NaN
3      NaN  hello
4      NaN     hi

In [69]:
dict_dfrm = pd.DataFrame({0:[1,2,3,4,5],1:[6,7,8,9,10]})#,index = [11,12,13,14,15])
dict_dfrm

   0   1
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [79]:
# using a series
series_df= pd.DataFrame(x)
x = pd.Series([1,2,3,4,5])
series_df

   0
0  1
1  2
2  3
3  4
4  5

In [80]:
# using DataFrame
df = pd.DataFrame(dict_dfrm)
df

   0   1
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [81]:
print(list(df))

[0, 1]

In [82]:
import numpy as np
np.array(df)

array([[ 1,  6],
       [ 2,  7],
       [ 3,  8],
       [ 4,  9],
       [ 5, 10]], dtype=int64)

In [83]:
df + series_df

    0   1
0   2 NaN
1   4 NaN
2   6 NaN
3   8 NaN
4  10 NaN

In [3]:
import pandas as pd

In [4]:
x = pd.DataFrame([[1,2,3,4,7,8,9,6],[6,7,8,9,6,7,7,6 ]])
y = pd.Series([3,4,5,6,7,8,9,6])
z = x+y
z

   0   1   2   3   4   5   6   7
0  4   6   8  10  14  16  18  12
1  9  11  13  15  13  15  16  12

In [5]:
x = pd.DataFrame([["a","b","c","d"]])
y = pd.Series(["c","f","g","i"])
z = x+y
z

    0   1   2   3
0  ac  bf  cg  di

In [29]:
x = [["gaurav",55],["rohit",34]]
y = pd.DataFrame(x ,columns= ["name","marks"])
y

     name  marks
0  gaurav     55
1   rohit     34

In [28]:
# Importing pandas library
import pandas as pd
 
# Creating and initializing a nested list
age = [['Aman', 95.5, "Male"], ['Sunny', 65.7, "Female"],
       ['Monty', 85.1, "Male"], ['toni', 75.4, "Male"]]
 
# Creating a pandas dataframe
df = pd.DataFrame(age, columns=['Name', 'Marks', 'Gender'],index=[11,21,31,41])
 
# Printing dataframe
df

     Name  Marks  Gender
11   Aman   95.5    Male
21  Sunny   65.7  Female
31  Monty   85.1    Male
41   toni   75.4    Male

# Essential Functionality
- Reindexing
  - An important method on pandas objects is reindex, which to create a new object with values rearranged according to the new index.

In [1]:
import pandas as pd

In [2]:
obj = pd.Series([45,23,87,56],index = ["d","c","b","a"])
obj

d    45
c    23
b    87
a    56
dtype: int64

In [3]:
obj2 = obj.reindex(["a","b","c","d"])      #rearranged according to the new index.
obj2

a    56
b    87
c    23
d    45
dtype: int64

In [10]:
# A series's index can be altered in place by assignment:
obj.index=(["a","b","c","d"])
obj

a    45
b    23
c    87
d    56
dtype: int64

In [19]:
obj = pd.DataFrame([[1,2,3,4],
                   [5,6,7,8]],index = ["b","a"])
obj

   0  1  2  3
b  1  2  3  4
a  5  6  7  8

In [16]:
obj2= obj.reindex(["a","b"])
obj2

   0  1  2  3
a  5  6  7  8
b  1  2  3  4

In [ ]:
# With DataFrame, Reindex can after the index, columns ,or both.

In [20]:
import numpy as np

In [50]:
df = pd.DataFrame(np.arange(9).reshape((3,3)),index = ["a","c","b"],columns = ["Y","Z","X"])
df

   Y  Z  X
a  0  1  2
c  3  4  5
b  6  7  8

In [51]:
df = df.reindex(index = ["a","b","c"],columns = ["X","Y","Z"])
df

   X  Y  Z
a  2  0  1
b  8  6  7
c  5  3  4

In [52]:
df = pd.DataFrame(np.arange(9).resize((3,3)),index = ["a","c","b"],columns = ["Y","Z","X"])
df

     Y    Z    X
a  NaN  NaN  NaN
c  NaN  NaN  NaN
b  NaN  NaN  NaN

In [53]:
df = (np.arange(9).resize((3,4)))# same object me values pass krne me memorey location change nhi na hi new shape create hoga
print(df)

None

In [55]:
np.arange(9).resize((3,4))

# Indexing, Selection and filtering 
- **Indexing with Series**
- Series indexing works simliar to Numpy array indexing, except you can use the Series's index value (lables) instead of only integers

In [2]:
import pandas as pd

In [3]:
ser1 = pd.Series([5,6,7,8])
print (ser1)
print()
ser1[2]

0    5
1    6
2    7
3    8
dtype: int64

7

In [4]:
ser2 = pd.Series([5,6,7,8],index =["a","b","c","d"])
print(ser2)
print()
ser2["a"]

a    5
b    6
c    7
d    8
dtype: int64

5

In [5]:
ser2[3]  # Numerical indexing also work

8

In [6]:
ser2 [["a","c","d"]]

a    5
c    7
d    8
dtype: int64

In [8]:
ser2[[0,1,3]]

a    5
b    6
d    8
dtype: int64

<br> While you can select data by label this way, the preferred way to select index values is with the speciak loc opertor

In [12]:
obj1 = pd.Series([1,2,3], index = [2,0,1])
obj2 = pd.Series([1,2,3],index=["a","b","c"])
print(obj1)

2    1
0    2
1    3
dtype: int64

In [13]:
print(obj2)

a    1
b    2
c    3
dtype: int64

In [14]:
obj1[0]

2

In [15]:
obj2[2]

3

<br> The.loc operator is used to select data by label

In [17]:
obj2.loc[[0,1,2]] #error because [0,1,2] are not the labels of obj2

KeyError: "None of [Int64Index([0, 1, 2], dtype='int64')] are in the [index]"

In [18]:
obj2[["a","c"]]

a    1
c    3
dtype: int64

In [20]:
obj1

2    1
0    2
1    3
dtype: int64

In [19]:
obj1.loc[[1,2]]

1    3
2    1
dtype: int64

<br>.iloc operater indexes only with integer and not by lables

In [23]:
obj1

2    1
0    2
1    3
dtype: int64

In [22]:
obj1.iloc[2]   # only index use by index start at 0

3

In [25]:
obj2

a    1
b    2
c    3
dtype: int64

In [24]:
obj2.iloc[1]

2

**Start and stop index are inclusive slicing by lables (by using or not using .loc)**

In [26]:
# Start and stop index are inclusive slicing by lables (by using or not using .loc)
print(obj2)

a    1
b    2
c    3
dtype: int64

In [27]:
obj2["a":"c"] # label stirde are last value not exclued

a    1
b    2
c    3
dtype: int64

In [28]:
obj2[0:2]  # number stride are last values exclued

a    1
b    2
dtype: int64

# **Indexing with DataFrame**

In [64]:
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,1]],index = ["A","B","C","D"],columns = ["Haldwani","Delhi","Ramnagar"])
df

   Haldwani  Delhi  Ramnagar
A         1      2         3
B         4      5         6
C         7      8         9
D        10     11         1

In [65]:
df ["Ramnagar"] # selecting a columns

A    3
B    6
C    9
D    1
Name: Ramnagar, dtype: int64

In [66]:
df.Ramnagar

A    3
B    6
C    9
D    1
Name: Ramnagar, dtype: int64

In [67]:
df[:2]  # Slicing the rows

   Haldwani  Delhi  Ramnagar
A         1      2         3
B         4      5         6

In [68]:
df["Haldwani"]>2 # Gives boolean array(boolean series)

A    False
B     True
C     True
D     True
Name: Haldwani, dtype: bool

In [69]:
df[df["Haldwani"]>2]#Selecting data with a boolean array

   Haldwani  Delhi  Ramnagar
B         4      5         6
C         7      8         9
D        10     11         1

In [70]:
df>2

   Haldwani  Delhi  Ramnagar
A     False  False      True
B      True   True      True
C      True   True      True
D      True   True     False

In [76]:
df[df<2] = 2
df

   Haldwani  Delhi  Ramnagar
A         2      2         3
B         4      5         6
C         7      8         9
D        10     11         2

In [ ]:
df = pd.DataFrame([[1,2,3,5],[4,5,6,4],[7,8,9,3],[10,11,1,9]],index = ["A","B","C","D"],columns = ["Haldwani","Delhi","Ramnagar","New Delhi"])
df

In [92]:
df["New Delhi"]

A    5
B    4
C    3
D    9
Name: New Delhi, dtype: int64

In [94]:
df.loc["A":"B"]

   Haldwani  Delhi  Ramnagar  New Delhi
A         1      2         3          5
B         4      5         6          4

In [95]:
df["Dehli":"New Delhi"]

Empty DataFrame
Columns: [Haldwani, Delhi, Ramnagar, New Delhi]
Index: []

In [97]:
df[:2]

   Haldwani  Delhi  Ramnagar  New Delhi
A         1      2         3          5
B         4      5         6          4

In [102]:
df["A"]

KeyError: 'A'

In [103]:
df.A

AttributeError: 'DataFrame' object has no attribute 'A'

In [104]:
df.loc[:"Haldwani"]

   Haldwani  Delhi  Ramnagar  New Delhi
A         1      2         3          5
B         4      5         6          4
C         7      8         9          3
D        10     11         1          9

In [106]:
df.Haldwani[:2]

A    1
B    4
Name: Haldwani, dtype: int64

| Method               | Comment                                                                   |
|----------------------|---------------------------------------------------------------------------|          
|df[column]            | Select single column or sequence of columns from the DataFrame            |
|df[slice]             | Slice rows                                                                |
|df[Boolean array]     | Filter rows                                                               |
|df[Boolean DataFrame] | set values based on same criterion                                        |
|df.loc[rows]          | Select single row or subset of rows from the DataFrame by lable           |
|df.loc[:,cols]        | Select single column or subset of columns by lable                        |
|df.loc[rows,clos]     | Select both row (s) and columns(s) by label                               |
|df.iloc[rows]         | Select single row or subset of rows from the DataFrame by integer position|
|df.iloc[:,clos]       |Select single column or subset od columns by integer position              |
|df.iloc[rows,cols]    | Select both row(s) and colums(s) by integer position                      |

In [1]:
import pandas as pd

In [7]:
df = pd.DataFrame({"a":[1,2,3,4],"b":[4,5,6,5],"c":[8,9,32,3]},index = ["R1","R2","R3","R4"])
df

    a  b   c
R1  1  4   8
R2  2  5   9
R3  3  6  32
R4  4  5   3

In [8]:
df["a"]   # df[columns]

R1    1
R2    2
R3    3
R4    4
Name: a, dtype: int64

In [14]:
df[0:3]

    a  b   c
R1  1  4   8
R2  2  5   9
R3  3  6  32

In [9]:
df["R1":"R3"]  # df[slice]

    a  b   c
R1  1  4   8
R2  2  5   9
R3  3  6  32

In [15]:
df[df["a"]>2]  # Boolean Array

    a  b   c
R3  3  6  32
R4  4  5   3

In [17]:
df<2   # Boolean Data Frame

        a      b      c
R1   True  False  False
R2  False  False  False
R3  False  False  False
R4  False  False  False

In [20]:
df[df<2] = 4
df

    a  b   c
R1  4  4   8
R2  2  5   9
R3  3  6  32
R4  4  5   3

In [21]:
df.loc["R3"]

a     3
b     6
c    32
Name: R3, dtype: int64

In [25]:
df

    a  b   c
R1  4  4   8
R2  2  5   9
R3  3  6  32
R4  4  5   3

In [33]:
df.loc[:,"a"]  #df.loc[:,cols]

R1    4
R2    2
R3    3
R4    4
Name: a, dtype: int64

In [45]:
df

    a  b   c
R1  4  4   8
R2  2  5   9
R3  3  6  32
R4  4  5   3

In [46]:
df.loc[["R2","R3"],["a","b"]]

    a  b
R2  2  5
R3  3  6

In [41]:
df.loc["R3":"c"] #df.loc[row:cols]

    a  b   c
R3  3  6  32
R4  4  5   3

In [48]:
df

    a  b   c
R1  4  4   8
R2  2  5   9
R3  3  6  32
R4  4  5   3

In [50]:
df.iloc[1:2,0:2]

    a  b
R2  2  5

In [68]:
pduct = pd.DataFrame([["Rise",900],["Dal",455],["Oil",1200],["Apple",1200],["Mango",890],["Kiwi",897]],index = ["a","b","c","d","e","f"],columns=["product","price"])
pduct

  product  price
a    Rise    900
b     Dal    455
c     Oil   1200
d   Apple   1200
e   Mango    890
f    Kiwi    897

In [71]:
pduct[pduct["price"]<1000]

  product  price
a    Rise    900
b     Dal    455
e   Mango    890
f    Kiwi    897

In [72]:
pduct[pduct["price"]>1000]

  product  price
c     Oil   1200
d   Apple   1200

In [ ]:
import pand